Tekla Open API Reference for Tekla Structures 2025
BaseWeld.IntermittentType Property
 Gets or sets the weld intermittent type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldIntermittentTypeEnum IntermittentType { get; set; }
Public Property IntermittentType As BaseWeld.WeldIntermittentTypeEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldIntermittentTypeEnum
Exceptions
Exception | Condition
ArgumentException | Thrown when provided value is not defined in the WeldIntermittentTypeEnum.
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace